{
  "_name_or_path": "nvidia/prompt-task-and-complexity-classifier",
  "attn_config": {
    "model_type": ""
  },
  "base_model": "microsoft/DeBERTa-v3-base",
  "config_path": null,
  "constraint_ct_map": {
    "1.0": 0,
    "Unknown": 1
  },
  "contextual_knowledge_map": {
    "No": 0,
    "Unknown": -1,
    "Yes": 1
  },
  "creativity_score_map": {
    "High": 0,
    "Low": 1,
    "No": 2
  },
  "d_model": 2048,
  "divisor_map": {
    "constraint_ct": 1,
    "contextual_knowledge": 1,
    "creativity_scope": 2,
    "domain_knowledge": 3,
    "no_label_reason": 1,
    "number_of_few_shots": 1,
    "reasoning": 1
  },
  "domain_knowledge_map": {
    "High": 0,
    "Low": 1,
    "Medium": 2,
    "No": 3
  },
  "drop_out": false,
  "emb_pdrop": 0.0,
  "embedding_fraction": 1.0,
  "expansion_ratio": 4,
  "fc_dropout": 0.2,
  "init_device": "cpu",
  "initializer_range": 0.02,
  "layer_norm_epsilon": 1e-05,
  "learned_pos_emb": true,
  "logit_scale": null,
  "max_seq_len": 2048,
  "model_output_type": {
    "constraint_ct": "numeric",
    "contextual_knowledge": "numeric",
    "creativity_scope": "numeric",
    "domain_knowledge": "numeric",
    "no_label_reason": "numeric",
    "number_of_few_shots": "numeric",
    "prompt_complexity_score": "numeric",
    "reasoning": "numeric",
    "task_type_1": "string",
    "task_type_2": "string",
    "task_type_prob": "numeric"
  },
  "model_type": "deberta-v2",
  "n_heads": 16,
  "n_layers": 24,
  "no_bias": true,
  "no_label_reason_map": {
    "Unknown": 0
  },
  "norm_type": "low_precision_layernorm",
  "number_of_few_shots_map": {
    "0.0": 0,
    "1.0": 1,
    "2.0": 2,
    "3.0": 3,
    "4.0": 4,
    "5.0": 5
  },
  "pretrained": true,
  "reasoning_map": {
    "No": 0,
    "Unknown": -1,
    "Yes": 1
  },
  "resid_pdrop": 0.0,
  "target_sizes": {
    "constraint_ct": 2,
    "contextual_knowledge": 2,
    "creativity_scope": 3,
    "domain_knowledge": 4,
    "no_label_reason": 1,
    "number_of_few_shots": 6,
    "reasoning": 2,
    "task_type": 12
  },
  "targets": [
    "task_type_1",
    "task_type_2",
    "task_type_prob",
    "creativity_scope",
    "reasoning",
    "contextual_knowledge",
    "number_of_few_shots",
    "domain_knowledge",
    "no_label_reason",
    "constraint_ct",
    "prompt_complexity_score"
  ],
  "task_type_map": {
    "0": "Brainstorming",
    "1": "Chatbot",
    "10": "Text Generation",
    "11": "Unknown",
    "2": "Classification",
    "3": "Closed QA",
    "4": "Code Generation",
    "5": "Extraction",
    "6": "Open QA",
    "7": "Other",
    "8": "Rewrite",
    "9": "Summarization"
  },
  "transformers_version": "4.46.3",
  "use_cache": false,
  "verbose": 0,
  "vocab_size": 50368,
  "weights_map": {
    "constraint_ct": [
      1,
      0
    ],
    "contextual_knowledge": [
      0,
      1
    ],
    "creativity_scope": [
      2,
      1,
      0
    ],
    "domain_knowledge": [
      3,
      1,
      2,
      0
    ],
    "no_label_reason": [
      0
    ],
    "number_of_few_shots": [
      0,
      1,
      2,
      3,
      4,
      5
    ],
    "reasoning": [
      0,
      1
    ]
  },
  "framework": "onnx",
  "tags": [
    "onnx",
    "quantized"
  ]
}