{
  "vocabulary": {
    "integer": 82,
    "common": 32,
    "integers": 83,
    "following": 61,
    "set": 147,
    "time": 170,
    "25": 5,
    "10": 0,
    "large": 85,
    "using": 183,
    "suppose": 166,
    "contains": 35,
    "complete": 33,
    "let": 87,
    "maximum": 101,
    "number": 110,
    "graph": 72,
    "true": 176,
    "following true": 64,
    "logic": 94,
    "sound": 152,
    "does": 45,
    "ii": 78,
    "iii": 79,
    "length": 86,
    "statements": 158,
    "equal": 53,
    "following statements": 63,
    "point": 124,
    "information": 81,
    "numbers": 111,
    "list": 93,
    "data": 38,
    "real": 139,
    "function": 69,
    "possible": 127,
    "table": 168,
    "used": 181,
    "linear": 91,
    "elements": 50,
    "order": 116,
    "variable": 186,
    "given": 71,
    "best": 14,
    "total": 172,
    "tree": 175,
    "following best": 62,
    "process": 131,
    "use": 180,
    "value": 184,
    "average": 12,
    "class": 31,
    "object": 112,
    "values": 185,
    "changes": 27,
    "source": 153,
    "property": 135,
    "truth": 177,
    "uses": 182,
    "determine": 41,
    "space": 154,
    "program": 134,
    "100": 1,
    "times": 171,
    "network": 108,
    "type": 179,
    "product": 133,
    "new": 109,
    "second": 144,
    "result": 141,
    "called": 18,
    "element": 49,
    "statement": 157,
    "make": 97,
    "states": 159,
    "describes": 40,
    "best describes": 15,
    "area": 9,
    "factor": 58,
    "cycle": 37,
    "rate": 137,
    "solution": 151,
    "line": 90,
    "12": 2,
    "probability": 130,
    "positive": 126,
    "way": 189,
    "increase": 80,
    "different": 43,
    "15": 3,
    "step": 160,
    "occurs": 114,
    "form": 67,
    "certain": 25,
    "20": 4,
    "likely": 89,
    "students": 162,
    "student": 161,
    "years": 191,
    "sum": 164,
    "plant": 122,
    "species": 155,
    "model": 104,
    "frequency": 68,
    "occur": 113,
    "explains": 57,
    "person": 121,
    "car": 19,
    "body": 17,
    "example": 55,
    "change": 26,
    "human": 77,
    "speed": 156,
    "ball": 13,
    "characteristic": 28,
    "greatest": 73,
    "current": 36,
    "small": 148,
    "people": 120,
    "equation": 54,
    "distance": 44,
    "constant": 34,
    "force": 66,
    "particle": 119,
    "group": 74,
    "day": 39,
    "long": 95,
    "radius": 136,
    "surface": 167,
    "volume": 187,
    "makes": 98,
    "water": 188,
    "did": 42,
    "sun": 165,
    "measure": 102,
    "population": 125,
    "year": 190,
    "experiment": 56,
    "argument": 10,
    "select": 145,
    "translation": 173,
    "predicate": 128,
    "select best": 146,
    "best translation": 16,
    "translation predicate": 174,
    "predicate logic": 129,
    "invalid": 84,
    "truth table": 178,
    "natural": 107,
    "gas": 70,
    "earth": 46,
    "animals": 8,
    "fish": 60,
    "help": 76,
    "environment": 52,
    "produce": 132,
    "temperature": 169,
    "mixture": 103,
    "light": 88,
    "atom": 11,
    "energy": 51,
    "mass": 99,
    "rest": 140,
    "carbon": 20,
    "charge": 29,
    "solar": 150,
    "moon": 105,
    "electric": 48,
    "field": 59,
    "magnetic": 96,
    "effect": 47,
    "material": 100,
    "cell": 23,
    "heat": 75,
    "moving": 106,
    "air": 7,
    "liquid": 92,
    "reaction": 138,
    "rock": 142,
    "causes": 22,
    "cause": 21,
    "soil": 149,
    "scientists": 143,
    "organisms": 117,
    "food": 65,
    "chemical": 30,
    "acid": 6,
    "substance": 163,
    "oxygen": 118,
    "ocean": 115,
    "cells": 24,
    "plants": 123
  },
  "idf": [
    4.560427079179767,
    5.304346585113136,
    5.592028657564917,
    5.7098116932213,
    5.132496328186477,
    5.48666814190709,
    5.592028657564917,
    5.346906199531932,
    5.461975529316719,
    5.064673731847716,
    5.620199534531613,
    5.48666814190709,
    5.511985949891381,
    5.808251766034553,
    3.407226600227255,
    4.721200299767519,
    5.537961436294641,
    5.1501959052858775,
    5.325399994310969,
    5.956671771152826,
    5.564629683376802,
    5.437877977737659,
    5.6491870714048655,
    5.808251766034553,
    5.774350214358872,
    5.461975529316719,
    4.858059482484716,
    5.461975529316719,
    5.537961436294641,
    5.620199534531613,
    5.304346585113136,
    5.537961436294641,
    5.620199534531613,
    5.511985949891381,
    5.304346585113136,
    5.7098116932213,
    5.774350214358872,
    5.592028657564917,
    5.098010152115307,
    5.016664512661356,
    4.3964241029094975,
    4.75670698822443,
    5.346906199531932,
    4.6646880895041765,
    5.2243038774396,
    4.32351733210141,
    4.164912301924772,
    5.391357962102766,
    5.592028657564917,
    5.437877977737659,
    5.205255682468906,
    4.033884039518368,
    5.6491870714048655,
    5.2243038774396,
    5.437877977737659,
    5.048413210975935,
    5.592028657564917,
    5.414347480327464,
    5.414347480327464,
    4.871482502816857,
    6.1310251582976045,
    2.6403063250073684,
    5.2243038774396,
    5.2243038774396,
    5.098010152115307,
    5.304346585113136,
    4.912867718979712,
    4.885088154872636,
    5.564629683376802,
    4.871482502816857,
    5.2243038774396,
    4.560427079179767,
    5.917451057999545,
    5.537961436294641,
    4.970854976630061,
    5.437877977737659,
    5.511985949891381,
    5.3688851062507075,
    5.186563549456753,
    5.186563549456753,
    5.2837272979104,
    5.414347480327464,
    5.620199534531613,
    5.592028657564917,
    5.956671771152826,
    5.243721963296702,
    5.346906199531932,
    5.016664512661356,
    4.793520961347145,
    3.828440065303558,
    5.6491870714048655,
    5.741560391535881,
    5.679040034554547,
    5.997493765673082,
    5.346906199531932,
    5.48666814190709,
    5.537961436294641,
    5.048413210975935,
    5.564629683376802,
    4.590580117350456,
    5.6491870714048655,
    5.620199534531613,
    5.592028657564917,
    5.879710730016698,
    5.437877977737659,
    5.620199534531613,
    5.7098116932213,
    5.741560391535881,
    5.997493765673082,
    5.3688851062507075,
    4.164912301924772,
    5.205255682468906,
    5.064673731847716,
    5.592028657564917,
    5.592028657564917,
    5.7098116932213,
    4.818838769331435,
    5.325399994310969,
    5.741560391535881,
    5.879710730016698,
    5.391357962102766,
    5.774350214358872,
    5.1501959052858775,
    4.858059482484716,
    5.3688851062507075,
    5.679040034554547,
    5.243721963296702,
    5.325399994310969,
    5.437877977737659,
    5.461975529316719,
    5.741560391535881,
    4.709639477366443,
    5.620199534531613,
    5.48666814190709,
    5.997493765673082,
    5.48666814190709,
    5.6491870714048655,
    5.48666814190709,
    5.592028657564917,
    5.620199534531613,
    5.48666814190709,
    5.132496328186477,
    5.414347480327464,
    5.3688851062507075,
    5.391357962102766,
    5.325399994310969,
    5.3688851062507075,
    5.1501959052858775,
    5.592028657564917,
    5.6491870714048655,
    5.461975529316719,
    5.391357962102766,
    5.620199534531613,
    5.391357962102766,
    5.6491870714048655,
    5.774350214358872,
    4.600836617517644,
    3.9338005809613845,
    5.048413210975935,
    5.6491870714048655,
    5.917451057999545,
    4.550574782736756,
    5.205255682468906,
    5.620199534531613,
    5.956671771152826,
    5.2243038774396,
    5.3688851062507075,
    4.793520961347145,
    5.2837272979104,
    4.73289633953071,
    4.611199404553191,
    5.346906199531932,
    5.168214410788556,
    5.437877977737659,
    5.537961436294641,
    5.679040034554547,
    4.37152655128777,
    5.511985949891381,
    6.040053380091877,
    4.941441091423767,
    4.430615467657777,
    4.191940974312691,
    5.592028657564917,
    4.560427079179767,
    4.6646880895041765,
    5.7098116932213,
    5.774350214358872,
    5.7098116932213,
    3.9606118384120417,
    5.243721963296702,
    5.843343085845823,
    5.620199534531613
  ],
  "max_features": 192,
  "ngram_range": [
    1,
    2
  ]
}